{
  "page": {
    "header": "Moje projekty",
    "text1": "Możesz zapoznać się z niektórymi z moich wcześniejszych projektów, które wykonałam sama.",
    "text2": "Portfolio, stworzyłam je w celu jasnego przedstawienia mojej osoby i moich umiejętności. Poniższe projekty, nad którymi sama pracowałam, znajdują się na GitHubie jako publiczne repozytorium. W podanych linkach możesz przejść do repozytorium i efektów pracy.",
    "text3": "Jeśli chcesz dowiedzieć się więcej o mojej pracy, projektach komercyjnych i moich umiejętnościach technicznych, w projektach w które byłam zaangażowana i jakie technologie użyłam, zapraszam do kontaktu. W miarę możliwości je opiszę."
  },
  "actOutsCard": {
    "header": "Act Outs (Strona Wordpress)",
    "shortDescription": "Stworzyłam niestandardowy motyw dla WordPress. Z kalendarzem wydarzeń, filmami i funkcją logowania dla użytkowników."
  },
  "englishCard": {
    "header": "Flick Through English (Strona Wordpress)",
    "shortDescription": "Utworzono stronę do lekcji angielskiego z różnymi grupami. Stworzyłam niestandardowy motyw motywu Rara-academic-child (oryginalny Rara academic). W motywie dodałam dodatkowe strony i typy postów dla studentów, stronę logowania oraz przekierowanie uczniów na stronę, w zależności od tego,  w jakiej grupie są zapisani."
  },
  "bazaarCard": {
    "header": "Przykładowa strona React (Bazaar)",
    "shortDescription": "Strona w  React „Strona produktów”. Ten projekt jest przeznaczony tylko do mojej samodzielnej nauki: React, Redux, context i Material UI. Stworzyłam go po ukończeniu kursu z  React, aby sprawdzić i rozwinąć umiejętności. To tylko przykładowa strona do samodzielnych ćwiczeń."
  },
  "kamcodeCard": {
    "header": "Strona wizytówka",
    "shortDescription": "Stworzyłam własną stronę internetową z podstawowymi językami programowania w technologii Frontend, z zachowaniem RWD."
  },
  "portfolioCard": {
    "header": "Strona Portfolio w React",
    "shortDescription": "Moje portfolio zawiera informacje o mnie, niektóre z moich własnych projektów, moje umiejętności i moją ścieżkę programistyczną. Strona zawiera dwa motywy ciemny i jasny, a także tłumaczenie, polski i angielski."
  },
  "customersListTable": {
    "header": "Tabela z listą użytkowników w React i Node (FullStack)",
    "shortDescription": "Tabela z formularzem do aktualizacji użytkowników. Jest stworzona w React z wykorzystaniem Bootstrapa i tailwindcss. Możemy tworzyć, edytować, usuwać i dodawać nowych użytkowników z danymi osobowymi. Backend jest zrealizowany w Node z użyciem mongoose. Baza danych jest przechowywana w MongoDB."
  },
  "blogListCard": {
    "header": "Aplikacja Blogowa - Kurs Full Stack w Helsinkach 2023",
    "shortDescription": "Jest to aplikacja do listy blogów stworzona przy użyciu Reacta i React Bootstrap do interfejsu użytkownika. Aplikacja ta powstała w ramach otwartego kursu online na Univeristy Helsinki. Główne funkcje aplikacji obejmują wyświetlanie listy przykładowych blogów z danymi takimi jak nazwa autora, tytuł i link do oryginalnego bloga. Zalogowani użytkownicy mogą komentować blogi i dodawać polubienia. Ponadto aplikacja ma komponent backendowy połączony z bazą danych MongoDB. Zarówno front-end, jak i back-end aplikacji zostały przetestowane, z użyciem Cypress do testowania front-endu i Jest do testowania back-endu."
  },
  "wpExampleTheme": {
    "header": "Wp Theme",
    "shortDescription": "Niestandardowy motyw, który może być używany w systemie CMS WordPress. Zawiera domyślne szablony dla stron, blogów, strona o nas  i ofert pracy. Strona główna jest w pełni dostosowana do dodawania własnych treści. Zintegrowałam dwa widgety do referencji i kartę, którą można połączyć z konkretną stroną. Dodatkowo, w stopce można dodać trzy kolumny na linki oraz dodać linki do mediów społecznościowych."
  },
  "projectsModal": {
    "header": "Opis",
    "actoutsContent": {
      "title": "Act Outs (Motyw WordPress)",
      "text1": "Projekt utworzony dla klienta, który chciał mieć dynamiczną stronę dla własnych celów. Stronę utworzyłam w Wordpresie, w celu zapewnienia możliwości łatwego dodawania lekcji, wydarzeń z tekstem, zdjęciami, plikami video.",
      "text2": "Zbudowałam motyw, który zawiera: ",
      "item1": "Header z logo oraz menu.",
      "item2": "Strona główna z sekcjami: ",
      "subItems": {
        "text1": "Sekcja – slider ze zdjęciami (możliwość dodawania zmieniania 4 zdjęć).",
        "text2": "Sekcja – powitalna z tekstem oraz zdjęciem",
        "text3": "Sekcja about – informacja o stronie (wybranie strony ).",
        "text4": "Sekcja 'Featured Videos', dwa posty z video.",
        "text5": "Sekcja możliwe kursy (możliwość wybrania z czterech stron zawierających video).",
        "text6": "Sekcja – wydarzenia. Wydarzenia są dodawane poprzez własny typ postów (event)."
      },
      "item3": "Cztery typy własnych stron (archive pages). Każda strona przeznaczona jest dla osobnej grupy docelowej. Informacje stron są wyświetlane dla osób które są zalogowane i mają określoną rolę użytkownika do wyświetlania informacji.",
      "item4": "Strona z kalendarzem. Do kalendarza dodawane są wydarzenia z własnego typu postów, 'event'. Jeśli użytkownik chce dodać wydarzenie do kalendarza musi dodać datę w ACF (advance custom fields) Może również dodać opis, color wydarzenia, czy wyświetlać informacje jako popper (chmurka) na kalendarzu, oraz wybrać priorytet wydarzenia (w przypadku gdy daty się powielają). Do tego celu utworzyłam json route w celu wykorzystania json dla kalendarza (js-year-calendar).",
      "item5": "Stopka, użytkownik może dodać cztery widgety do stopki.",
      "item6": "Również motyw posiada ",
      "subItems2": {
        "text1": "Dwa sidebary.",
        "text2": "Dodatkowy widget dla wydarzeń (wyświetlanie 3 najwcześniejszych wydarzeń).",
        "text3": "Dodatkowy widget z wybraniem 'social links' (4 linki z ikonami)."
      },
      "techStack": "Stack technologiczny: "
    },
    "bazaarContent": {
      "title": "Przykładowa strona z produktami (React)",
      "text1": "strona zawiera: ",
      "item1": "Strona główna: Lista kart produktów z filtrem kategorii i filtrem ceny.",
      "item2": "Strona profilu: dane zalogowanego użytkownika, panel klientów na lewym pasku bocznym, ustawienia użytkownika.",
      "item3": "Logowanie (modal z  logowaniem).",
      "item4": "Strona rejestracji: rejestracja nowego użytkownika, formularz z weryfikacją.",
      "item5": "Dla zalogowanych użytkowników: ",
      "subItems": {
        "text1": "Strona dodania nowego produktu: formularz z walidacją, aby dodać nowe produkty.",
        "text2": "Strona edycji produktu: formularz z walidacją, aby edytować istniejący produkt.",
        "text3": "Strona produktów: lista produktów z funkcją usuwania lub edytowania produktu."
      },
      "item6": "Sidebar z koszykiem produktów: lista wybranych Produktów z przyciskami zmniejszania, zwiększania liczby produktów oraz przyciskiem zapłać teraz.",
      "item7": "Strona podsumowania: check-out z 5 krokami do wypełnienia.",
      "subItems2": {
        "text1": "Krok pierwszy: Wyświetlenie listy wybranych produktów, z bocznym paskiem do wykorzystania kodu rabatowego i wybrania opcji dostawy.",
        "text2": "Krok drugi: formularz z opcją szczegółów (pola adresowe) z bocznym podsumowaniem.",
        "text3": "Krok trzeci: formularz płatności, w którym użytkownik może wprowadzić dane karty.",
        "text4": "Krok czwarty: podsumowanie wybranych produktów, dane adresowe, sposób dostawy, sposób płatności oraz cenę końcową."
      }
    },
    "englishPageContent": {
      "title": "Flick Through English (Wordpress)",
      "text1": "Projekt utworzony dla klienta, który chciał mieć dynamiczną stronę dla własnych celów. Stronę utworzyłam w Wordpresie, w celu zapewnienia możliwości łatwego dodawania lekcji, wydarzeń z tekstem, zdjęciami, plikami video.",
      "text2": "Motyw child's rare-academic posiada: ",
      "item1": "Header z logo oraz menu.",
      "item2": "Strona główna z sekcjami: ",
      "subItems": {
        "text1": "Sekcja – slider ze zdjęciami, opisem i przyciskiem więcej informacji.",
        "text2": "Sekcja – o mnie.",
        "text3": "Sekcja - o czterech grupach nauczania.",
        "text4": "Sekcja - kroki nauczania.",
        "text5": "Sekcja – kontakt.",
        "text6": "Stopka"
      },
      "item3": "Cztery typy własnych stron (archive pages). Każda strona przeznaczona jest dla osobnej grupy docelowej. Informacje stron są wyświetlane dla osób które są zalogowane i mają określoną rolę użytkownika do wyświetlania informacji.",
      "item4": "Footer - Użytkownik może dodać 4 widgets."
    },
    "customerListTable": {
      "title": "Lista klientów React. Projekt Full Stack",
      "text1": "Aplikacja React w TypeScript. Tworzenie tabeli z użyciem Bootstrap i stylizacja za pomocą tailwindcss.",
      "text2": "Backend stworzony w Node.js. Wdrożony na render.com. Dane są przechowywane w bazie MongoDB.",
      "item1": "Aplikacja zawiera 3 strony:",
      "subItems": {
        "text1": "Strona główna, która wyświetla wszystkie dane, pobierane z API https://customers-api-sgd5.onrender.com.",
        "text2": "Strona edycji: Formularz do edycji pojedynczego klienta.",
        "text3": "Strona dodawania nowego kontaktu: Formularz do dodawania nowych danych klienta."
      }
    },
    "blogListApp": {
      "title": "Aplikacja Blogowa - Kurs Full Stack w Helsinkach 2023",
      "text1": "Aplikacja React do wyświetlania listy blogów z tytułami, autorami i oryginalnymi adresami URL. Do stylizacji użyto React Bootstrap.",
      "text2": "Serwer aplikacji został stworzony przy użyciu Node.js i jest wdrożony na render.com. Dane są przechowywane w bazie danych MongoDB, korzystając z darmowego okresu próbnego. Czasami mogą występować dłuższe czasy wczytywania danych ze względu na charakter darmowych prób, które mogą wiązać się z pewnymi ograniczeniami lub restrykcjami.",
      "text3": "Aplikacja do listy blogów obejmuje:",
      "item1": "Lista Blogów",
      "subItems1": {
        "text1": "Wyświetlanie nieuporządkowanej listy blogów.",
        "text2": "Przycisk 'Dodaj blog'. Po kliknięciu 'Dodaj blog' wyświetlany jest  formularz umożliwiający dodanie bloga z polami na tytuł, autora, URL (do oryginalnego bloga) oraz przycisk anulowania."
      },
      "item2": "Pojedynczy Blog",
      "subItems2": {
        "text1": "Po kliknięciu na pojedynczy blog, użytkowik jest przeniesiony na stronę '/blogs/:id'.",
        "text2": "Wyświetlanie karty z danymi bloga oraz funkcje usuwania i dodawania polubień.",
        "text3": "Sekcja komentarzy. Zalogowani użytkownicy mogą dodawać komentarze pod blogiem."
      },
      "item3": "Strona Użytkowników",
      "subItems3": {
        "text1": "Wyświetlenie wszystkich użytkowników w tabeli wraz z liczbą dodanych przez nich blogów."
      },
      "item4": "Pojedynczy Użytkownik",
      "subItems4": {
        "text1": "Po kliknięciu na użytkownika, użytkownik jest przeniesiony  na stronę wyświetlającą profil użytkownika z tytułami wszystkich blogów, które zostały przez niego dodane."
      },
      "item5": "Strony dla logowania i ejestrowania użytkownika. "
    }
  }
}
